docs: replace plantuml with mermaid (#209)
Signed-off-by: Andres Vallecilla <andresfelipe083195@hotmail.com>
